//
//  BeautyDictionaryTableViewCellModel.swift
//  Sisters Staging
//
//  Created by Developer on 03.08.2023.
//

import Foundation

struct BeautyDictionaryTableViewCellModel {
    let id = UUID()
    let title: String
    let subtitle: String
    
    static let mockedData: [BeautyDictionaryTableViewCellModel] = [
        BeautyDictionaryTableViewCellModel(title: "Антиоксидант", subtitle: "Речовина, яка запобігає окисненню та пошкодженню клітин шкіри, зменшує вплив вільних радикалів та покращує загальний стан шкіри."),
        BeautyDictionaryTableViewCellModel(title: "Біотин", subtitle: "Вітамін В-комплексу, який сприяє зміцненню волосся та нігтів, покращує стан шкіри та сприяє загальному здоров'ю."),
        BeautyDictionaryTableViewCellModel(title: "Тонер", subtitle: "Догляд за ніжною шкірою обличчя – це, в першу чергу, очищення плюс зволоження. І засоби для цього слід підбирати відповідно до типу шкіри, щоб вона дихала, залишалася зволоженою та насичувалася корисними речовинами із твоєї улюбленої косметики."),
        BeautyDictionaryTableViewCellModel(title: "Тонер", subtitle: "Догляд за ніжною шкірою обличчя – це, в першу чергу, очищення плюс зволоження. І засоби для цього слід підбирати відповідно до типу шкіри, щоб вона дихала, залишалася зволоженою та насичувалася корисними речовинами із твоєї улюбленої косметики."),
        BeautyDictionaryTableViewCellModel(title: "Туш", subtitle: "Особлива фарба, виготовлена із сажі, що вживається для креслення і малювання."),
        BeautyDictionaryTableViewCellModel(title: "Маска", subtitle: "Ось чому косметологи все частіше рекомендують окрім міцелярної води або пінки для вмивання і до нанесення зволожуючого або нічного крему використовувати додаткові засоби, з якими мікрочастинки пилу і косметики не залишаться на обличчі, а шкіра буде зволоженою. Для цих цілей існують тоніки і тонери, що забезпечують той самий додатковий проміжний догляд."),
        BeautyDictionaryTableViewCellModel(title: "Маска", subtitle: "Ось чому косметологи все частіше рекомендують окрім міцелярної води або пінки для вмивання і до нанесення зволожуючого або нічного крему використовувати додаткові засоби, з якими мікрочастинки пилу і косметики не залишаться на обличчі, а шкіра буде зволоженою. Для цих цілей існують тоніки і тонери, що забезпечують той самий додатковий проміжний догляд."),
        BeautyDictionaryTableViewCellModel(title: "Дезодоранти", subtitle: "Механізм дії дезодорантів полягає в запобіганні розмноження бактерій у вологому середовищі, і в поглинанні природних запахів тіла і інших нав'язливих запахів. До складу дезодорантів часто входять дезінфікуючі і бактерицидні добавки, що знищують мікроорганізми і перешкоджають появі неприємного запаху."),
    ]
}

